/*
 * Парс числа с Number.parseInt() и Number.parseFloat()
 */

/*
 * - Метод число.toFixed(digits)
 */

/*
 * - Приведение (преобразование) к числу с Number(value)
 * - Значение NaN (Not a Number) и метод Number.isNaN(value)
 */

/*
 * Обьект Math
 * - Возведение в степень
 * - Exponent operator
 */

/*
 * Напиши скрипт который просит пользователя ввести число и степень,
 * возводит число в эту степень и выводит результат в консоль
 */

//  1. попросить ввести число и сохранить в переменную
//  2. попросить ввести степень и сохранить в переменную
//  3. Возвести введенные данные в степень и вывести

/*
 * Генерим псевдослучайные числа
 * - Math.random()
 * - Math.round()
 */
