/*
 * Парс числа з Number.parseInt() та Number.parseFloat()
 */

/*
 * - Метод число.toFixed(digits)
 */

/*
 * - Приведення (перетворення) до Number(value)
 * - Значення NaN (Not a Number) та метод Number.isNaN(value)
 */

/*
 * Об'єкт Math
 * - Зведення в ступінь
 * - Exponent operator
 */

/*
 * Напиши скрипт який просить користувача ввести число та ступінь,
 * зводить число в цей ступінь і виводить результат у консоль
 */

// 1. попросити ввести число і зберегти змінну
// 2. попросити ввести ступінь і зберегти змінну
// 3. Звести введені дані у ступінь та вивести

/*
 * Генерим псевдовипадкові числа
 * - Math.random()
 * - Math.round()
 */
