/**
 * Ітерація по масиву
 *
 * - Ітерація по масиву циклом for
 * - Метод includes
 * - Цикл for...of
 * - Різниця у використанні for и for...of
 */

// const arr = [5, 5, 5, 4, 5, 4, 5];

// const result = arr.includes(5);
// console.log(result);

// for (let i = 0; i < arr.length; i++) {
//   arr[i] *= 2;
// }

// for (let number of arr) {
//   number += 10;
//   console.log(number);
// }

/**
 * Напиши скрипт для обчислення площі прямокутника зі сторонами,
 * значення яких зберігаються у змінній values у вигляді рядка.
 * Значення гарантовано розділені пробілом.
 */

const values = '8 11';

// const result = values.split(' ');

// const a = Number(result[0]);
// const b = Number(result[1]);

// console.log(a * b);

/**
 * Напиши скрипт для перебору масиву fruits.
 * Для кожного елемента масиву виведи в консоль рядок
 * у форматі номер_елемента: значення_елемента.
 * Нумерація елементів повинна починатися з 1.
 */

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];

// for (let i = 1; i < fruits.length; i++) {
//   console.log(`${i + 1}: ${fruits[i]}`);
// }
