/*
 * Довжина рядка, властивість length
 */

/*
 * Конкатенація рядків
 */

/*
 * Напиши скрипт який виведе рядок у форматі:
 * «Гість x y поселяється в z номер q»,
 * Підставивши замість x y z q значення змінних
 */

/*
 * Шаблонні рядки (template strings)
 * Повертаємося до складання рядка поселення в готель
 */

/*
 * Нормалізація з методом toLowerCase()
 */

/*
 * Пошук у рядку з методом includes()
 */
const blacklistedWord1 = 'спам';
const blacklistedWord2 = 'розпродаж';

const string1 = 'Привіт, я принц Абдул, це не спам, пропоную тобі мільйон!';
const string2 = 'Найбільша РОЗПРОДАЖ цього тижня, не пропустіть!';
const string3 = 'Рекламна кампанія #fatlivesmatter';
