/*
 * Приведення до булю на прикладі Boolean (value)
 */
// 0 - false
// 1 - true
// "aefsa" - true
// '' - false
// null - false
// undefined - false
// true - true
// false - false

/*
 * Логічне І (оператор &&)
 * - Запинається на брехні
 * - Повертає те, на чому запнулося або останній операнд
 */

// 1 * 1 = 1
// "test" && "hello";
// "" && "hello";
// false && true;
// 5 && 10

/*
 * Логічне АБО (оператор ||)
 * - Запинається на правді
 * - Повертає те, на чому запнулося або останній операнд
 */

// false || ""; ->

// && - *;
// || - +
// true - 1
// false - 0

// const userAge = 20;
// const money = 10000;

// console.log(userAge >= 18 && money >= 1000);

/*
 * Логічне НЕ (оператор!)
 * Робить інверсію правда > брехня та брехня > правда
 */

// console.log(!true);
// console.log(!false);

// 10 != 20;
