/*
 * Напиши скрипт обробки покупки у магазині.
 *
 * - Баланс користувача зберігається в змінній balance
 * - Сума купівлі зберігається у змінній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 * - Відняти з балансу суму покупки
 * - Вивести повідомлення «На рахунку залишилося [число] кредитів»
 * - Якщо сума покупки перевищує баланс:
 * - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - Наприкінці вивести повідомлення «Операцію завершено»
 */

let balance = 10000;
const payment = 2000;

// 'Все добре, знімаємо гроші... Дякую за покупку!'
